<a href="https://colab.research.google.com/github/MohammedWasi/DataScience-Essentials/blob/main/Day_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Questions 1:
How to import pandas and check the version?

In [1]:
import pandas as pd
print(pd.__version__)

1.1.4


Questions 2:
How to create a series from a numpy array?

In [2]:
import numpy as np
arr=np.array([2,3,6,7,5])
s=pd.Series(arr)
s

0    2
1    3
2    6
3    7
4    5
dtype: int64

Questions 3:
How to convert the index of a series into a column of a dataframe?

In [3]:
df = s.to_frame().reset_index()
df

   index  0
0      0  2
1      1  3
2      2  6
3      3  7
4      4  5

In [4]:
df.rename(columns={0:"values"}, inplace=True)
df

   index  values
0      0       2
1      1       3
2      2       6
3      3       7
4      4       5

Questions 4:
Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the materials folder)

In [5]:
import seaborn as sns

In [6]:
sns.load_dataset

In [7]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [8]:
dd=sns.load_dataset('mpg')
dd

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

Questions 5:
Which country origin cars are a part of this dataset?

In [9]:
dd['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

Questions 6:
Extract the part of the dataframe which contains cars belonging to 'usa'

In [27]:
us=dd.loc[dd['origin']=='usa']

In [28]:
us

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]